<html>
<head>
<meta charset="utf-8">
<title>字符串函数处理</title>
</head>
<body>
<!-- --------------------------------处理HTML标签函数-------------------------------------------- -->
<?php 

 /*   $arry=<<<HTML //<<<HTML是标识符（<<<START也可以使用）
    <p style="color:red; font-size:24px">阿道夫萨德尔</p><br />
    <div style="color:red; font-size:24px">所发生的粉色</div>
HTML;
    echo strip_tags($arry,'<p><div>');  //处理HTML标签函数 */
  ?>
 <!-- -----------------------------------字符串截取函数----------------------------------------------------------- -->
  <?php 
    $var='tsdddasdwds';
    echo substr($var, 2); //字符串截取函数如果截取开始数为负数那么就从字符串后面开始计算
    ?>
    <br />
<!-- ----------------------------------------字符串分隔函数------------------------------------------------------------ -->
	<?php 
	   $las='test0,test1,test1,test2';
	   print_r(explode(',', $las,2));  //能把一个字符串分隔成为数组，在后面加上数字能设定分隔成多少个
	   
	   $las1='test';
	   echo '<br />';
	   var_dump(str_split($las1,2)); //把字符串转换成为数组，后面加上数字可限制每个数据的字段
	?>

</body>
</html>